{
  "terms": [
    { "term": "Witcher", "definition": "A professional monster hunter enhanced through rigorous training, alchemical mutations, and magical preparation. Witchers undergo the Trial of the Grasses as children, which mutates their bodies to give them superhuman abilities. They are trained in various schools, each with distinctive fighting styles. Most witchers are sterile and age slowly." },
    { "term": "Elder Blood (Hen Ichaer)", "definition": "An ancient elven gene that grants carriers immense magical potential, including the ability to travel between worlds and through time. Ciri is the most powerful living carrier of Elder Blood, making her extremely valuable and dangerous. The gene is prophesied to either save or destroy the world." },
    { "term": "The Continent", "definition": "The main landmass where The Witcher takes place, containing numerous kingdoms including Cintra, Nilfgaard, Temeria, Redania, and Kaedwen. The Continent is populated by humans, elves, dwarves, gnomes, and various monster species." },
    { "term": "Kaer Morhen", "definition": "The ancient mountain fortress where witchers of the School of the Wolf are trained. Once a thriving academy, it was attacked by an angry mob, and now only a handful of witchers remain. It's where Geralt was trained and serves as a sanctuary for witchers." },
    { "term": "Aretuza", "definition": "The premier magical academy for sorceresses, located on Thanedd Island. Run by Tissaia de Vries, it trains young women with magical potential to become powerful mages who serve as advisors to kings and kingdoms." },
    { "term": "The Law of Surprise", "definition": "An ancient custom where someone who saves another's life can claim something the saved person has but doesn't know about yet - typically an unborn child. This law bound Ciri to Geralt, making her his Child of Surprise." },
    { "term": "Signs", "definition": "Simple combat magic that all witchers learn. The five signs are: Igni (fire), Aard (telekinetic force), Quen (protective shield), Yrden (magic trap), and Axii (mind influence). While less powerful than true sorcery, Signs don't require verbal incantations." },
    { "term": "Trial of the Grasses", "definition": "The brutal alchemical process that transforms children into witchers. Candidates are given mutagenic compounds including the Grasses, which causes intense pain and often death. Only 3-4 out of 10 children survive. Those who do gain enhanced abilities and distinctive eyes with vertical pupils." },
    { "term": "Chaos", "definition": "The fundamental magical force in the world. Sorcerers and sorceresses draw upon Chaos to perform magic. It's unpredictable and dangerous, requiring years of training to control. Yennefer lost her connection to Chaos after Sodden Hill." },
    { "term": "The Conjunction of the Spheres", "definition": "A cataclysmic event 1,500 years ago when the boundaries between dimensions collapsed, bringing humans, monsters, and new species to the Continent. It fundamentally changed the world and is connected to Elder Blood abilities." },
    { "term": "Nilfgaard", "definition": "The large southern empire known for its aggressive expansionism and distinctive black armor. Led by Emperor Emhyr var Emreis, Nilfgaard seeks to conquer the Northern Kingdoms and capture Ciri for her Elder Blood." },
    { "term": "The Brotherhood of Sorcerers", "definition": "An organization of male and female mages who serve as advisors to the Northern Kingdoms. They meet in secret council to discuss matters of magic and politics, often manipulating events from behind the scenes." },
    { "term": "Scoia'tael", "definition": "Elven guerrilla fighters (meaning 'Squirrels' in Elder Speech) who resist human oppression. They often ally with Nilfgaard against the Northern Kingdoms, seeking to reclaim their ancestral lands." },
    { "term": "Battle of Sodden Hill", "definition": "A massive battle where Northern mages, including Yennefer, made a desperate stand against the Nilfgaardian invasion. Though they won, many mages died or were gravely wounded. Yennefer sacrificed her magic in the battle." },
    { "term": "Cintra", "definition": "A Northern Kingdom ruled by Queen Calanthe (the Lioness of Cintra). It was destroyed by Nilfgaard in the opening of the series, forcing Princess Ciri to flee. Cintra's fall marks the beginning of the main story." },
    { "term": "Child of Surprise", "definition": "A person claimed through the Law of Surprise. They share a mystical bond with the one who claimed them, often described as destiny. Ciri is Geralt's Child of Surprise." },
    { "term": "Mutations", "definition": "Additional alchemical enhancements some witchers undergo beyond the Trial of the Grasses. Geralt underwent extra mutations that made him more powerful but turned his hair white, earning him the nickname 'White Wolf.'" },
    { "term": "Shaerrawedd", "definition": "Ancient elven ruins hidden in the mountains where elves once lived before humans arrived. It serves as a temporary sanctuary for Geralt, Yennefer, and Ciri in Season 3." },
    { "term": "Destiny", "definition": "A powerful force in The Witcher universe that binds people together through prophecy and magical laws. Characters often struggle against destiny while being drawn toward their fated paths." },
    { "term": "Wild Hunt", "definition": "Spectral riders from another dimension who hunt across the sky. They seek Ciri for her Elder Blood abilities to save their dying world. The Wild Hunt is one of the greatest threats in the series." }
  ]
}
